In [2]:
import pandas as pd
import numpy as np
from src import soporte as sp

# Visualizaci贸n
# ------------------------------------------------------------------------------
import matplotlib.pyplot as plt
import seaborn as sns
# Configuraci贸n
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

# Fase 1: Exploraci贸n y Limpieza
## 1. Exploraci贸n Inicial:

In [3]:
df_flight = pd.read_csv("data/Customer Flight Activity.csv")
df_flight.head()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0

In [4]:
df_loyalty = pd.read_csv("data/Customer Loyalty History.csv")
df_loyalty.head()

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [4]:
print(f"El csv de Actividad de Vuelos de los Clientes tiene {df_flight.shape[0]} filas y {df_flight.shape[1]} columnas ")
print("--------------")
print(f"El csv de Historial de los Clientes tiene {df_loyalty.shape[0]} filas y {df_loyalty.shape[1]} columnas ")

El csv de Actividad de Vuelos de los Clientes tiene 405624 filas y 10 columnas
--------------
El csv de Historial de los Clientes tiene 16737 filas y 16 columnas

In [5]:
df_flight.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 10 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(9)
memory usage: 30.9 MB

In [6]:
sp.exploracion(df_flight)

El DataFrame tiene 405624 filas y 10 columnas.
    Tiene 1864 datos duplicados, lo que supone un porcentaje de 0.0% de los datos.

    Hay 0 columnas con datos nulos, y son:
    []

    y sin nulos hay 10 columnas y son:
    ['Loyalty Number', 'Year', 'Month', 'Flights Booked', 'Flights with Companions', 'Total Flights', 'Distance', 'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed']


    A continuaci贸n tienes un detalle sobre los datos nulos y los tipos y n煤mero de datos:

                        % nulos % no_nulos tipo_dato  num_valores_unicos
Loyalty Number             0.0%     100.0%     int64               16737
Year                       0.0%     100.0%     int64                   2
Month                      0.0%     100.0%     int64                  12
Flights Booked             0.0%     100.0%     int64                  22
Flights with Companions    0.0%     100.0%     int64                  12

Principales estad铆sticos de las columnas categ贸ricas:
No hay columnas categ贸ricas en el DataFrame.
Principales estad铆sticos de las columnas num茅ricas:

,count,mean,std,min,25%,50%,75%,max
Loyalty Number,405624.0,550037.873084,258935.286969,100018.0,326961.00,550834.0,772194.00,999986.0
Year,405624.0,2017.500000,0.500001,2017.0,2017.00,2017.5,2018.00,2018.0
Month,405624.0,6.500000,3.452057,1.0,3.75,6.5,9.25,12.0
Flights Booked,405624.0,4.115052,5.225518,0.0,0.00,1.0,8.00,21.0
Flights with Companions,405624.0,1.031805,2.076869,0.0,0.00,0.0,1.00,11.0
Total Flights,405624.0,5.146858,6.521227,0.0,0.00,1.0,10.00,32.0
Distance,405624.0,1208.880059,1433.155320,0.0,0.00,488.0,2336.00,6293.0
Points Accumulated,405624.0,123.692721,146.599831,0.0,0.00,50.0,239.00,676.5
Points Redeemed,405624.0,30.696872,125.486049,0.0,0.00,0.0,0.00,876.0
Dollar Cost Points Redeemed,405624.0,2.484503,10.150038,0.0,0.00,0.0,0.00,71.0

                            % nulos % no_nulos tipo_dato  num_valores_unicos
Loyalty Number                 0.0%     100.0%     int64               16737
Year                           0.0%     100.0%     int64                   2
Month                          0.0%     100.0%     int64                  12
Flights Booked                 0.0%     100.0%     int64                  22
Flights with Companions        0.0%     100.0%     int64                  12
Total Flights                  0.0%     100.0%     int64                  33
Distance                       0.0%     100.0%     int64                4746
Points Accumulated             0.0%     100.0%   float64                1549
Points Redeemed                0.0%     100.0%     int64                 587
Dollar Cost Points Redeemed    0.0%     100.0%     int64                  49

In [7]:
sp.exploracion(df_loyalty)

El DataFrame tiene 16737 filas y 16 columnas.
    Tiene 0 datos duplicados, lo que supone un porcentaje de 0.0% de los datos.

    Hay 3 columnas con datos nulos, y son:
    ['Salary', 'Cancellation Year', 'Cancellation Month']

    y sin nulos hay 13 columnas y son:
    ['Loyalty Number', 'Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type', 'Enrollment Year', 'Enrollment Month']


    A continuaci贸n tienes un detalle sobre los datos nulos y los tipos y n煤mero de datos:

               % nulos % no_nulos tipo_dato  num_valores_unicos
Loyalty Number    0.0%     100.0%     int64               16737
Country           0.0%     100.0%    object                   1
Province          0.0%     100.0%    object                  11
City              0.0%     100.0%    object                  29
Postal Code       0.0%     100.0%    object                  55

Principales estad铆sticos de las columnas categ贸ricas:

                 count unique       top   freq
Country          16737      1    Canada  16737
Province         16737     11   Ontario   5404
City             16737     29   Toronto   3351
Postal Code      16737     55   V6E 3D9    911
Gender           16737      2    Female   8410
Education        16737      5  Bachelor  10475
Marital Status   16737      3   Married   9735
Loyalty Card     16737      3      Star   7637
Enrollment Type  16737      2  Standard  15766

Principales estad铆sticos de las columnas num茅ricas:

,count,mean,std,min,25%,50%,75%,max
Loyalty Number,16737.0,549735.880445,258912.132453,100018.00,326603.00,550434.00,772019.00,999986.00
Salary,12499.0,79245.609409,35008.297285,-58486.00,59246.50,73455.00,88517.50,407228.00
CLV,16737.0,7988.896536,6860.982280,1898.01,3980.84,5780.18,8940.58,83325.38
Enrollment Year,16737.0,2015.253211,1.979111,2012.00,2014.00,2015.00,2017.00,2018.00
Enrollment Month,16737.0,6.669116,3.398958,1.00,4.00,7.00,10.00,12.00
Cancellation Year,2067.0,2016.503145,1.380743,2013.00,2016.00,2017.00,2018.00,2018.00
Cancellation Month,2067.0,6.962748,3.455297,1.00,4.00,7.00,10.00,12.00

                   % nulos % no_nulos tipo_dato  num_valores_unicos
Loyalty Number        0.0%     100.0%     int64               16737
Country               0.0%     100.0%    object                   1
Province              0.0%     100.0%    object                  11
City                  0.0%     100.0%    object                  29
Postal Code           0.0%     100.0%    object                  55
Gender                0.0%     100.0%    object                   2
Education             0.0%     100.0%    object                   5
Salary              25.32%     74.68%   float64                5890
Marital Status        0.0%     100.0%    object                   3
Loyalty Card          0.0%     100.0%    object                   3
CLV                   0.0%     100.0%   float64                7984
Enrollment Type       0.0%     100.0%    object                   2
Enrollment Year       0.0%     100.0%     int64                   7
Enrollment Month      0.0%     100.0%     int64                  12
Cancellation Year   87.65%     12.35%   float64                   6
Cancellation Month  87.65%     12.35%   float64                  12

In [8]:
duplicados = df_flight[df_flight.duplicated(keep=False)] 
duplicados.tail(10)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
404667,949628,2018,12,0,0,0,0,0.0,0,0
404668,949628,2018,12,0,0,0,0,0.0,0,0
404883,960050,2018,12,0,0,0,0,0.0,0,0
404884,960050,2018,12,0,0,0,0,0.0,0,0
405110,971370,2018,12,0,0,0,0,0.0,0,0
405111,971370,2018,12,0,0,0,0,0.0,0,0
405409,988392,2018,12,0,0,0,0,0.0,0,0
405410,988392,2018,12,0,0,0,0,0.0,0,0
405436,989528,2018,12,0,0,0,0,0.0,0,0
405437,989528,2018,12,0,0,0,0,0.0,0,0

In [9]:
df_flight[df_flight["Loyalty Number"] == 208485].head(6)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
2032,208485,2017,1,4,1,5,2275,227.0,0,0
2033,208485,2017,1,0,0,0,0,0.0,0,0
18933,208485,2017,2,4,0,4,1408,140.0,0,0
18934,208485,2017,2,1,1,2,874,87.0,0,0
35834,208485,2017,3,3,0,3,2208,220.0,0,0
35835,208485,2017,3,0,0,0,0,0.0,0,0

In [10]:
df_flight.columns

Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed'],
      dtype='object')

In [5]:
# agrupo por loyalty number, a帽o y mes, y que me sume el resto de valores para solucionar problema de registros duplicados (meses)
df_flight_agrupado = df_flight.groupby(["Loyalty Number", "Year", "Month"], as_index=False).agg({'Flights Booked': 'sum', 'Flights with Companions': 'sum', 'Total Flights': 'sum', 'Distance': 'sum', 'Points Accumulated': 'sum', 'Points Redeemed': 'sum', 'Dollar Cost Points Redeemed': 'sum'})

In [5]:
df_flight_agrupado.duplicated().sum()

np.int64(0)

In [13]:
df_flight_agrupado.tail()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
401683,999986,2018,8,8,1,9,3672,367.0,655,53
401684,999986,2018,9,0,0,0,0,0.0,0,0
401685,999986,2018,10,6,0,6,708,70.0,0,0
401686,999986,2018,11,11,4,15,2040,204.0,0,0
401687,999986,2018,12,0,0,0,0,0.0,0,0

In [13]:
df_flight_agrupado[df_flight_agrupado["Loyalty Number"] == 208485]

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
48384,208485,2017,1,4,1,5,2275,227.00,0,0
48385,208485,2017,2,5,1,6,2282,227.00,0,0
48386,208485,2017,3,3,0,3,2208,220.00,0,0
48387,208485,2017,4,12,6,18,1440,144.00,0,0
48388,208485,2017,5,13,0,13,3848,384.00,0,0
48389,208485,2017,6,16,5,21,4137,413.00,0,0
48390,208485,2017,7,20,9,29,2523,252.00,0,0
48391,208485,2017,8,27,0,27,6426,642.00,0,0
48392,208485,2017,9,13,0,13,3497,349.00,0,0
48393,208485,2017,10,19,3,22,4268,426.00,0,0
48394,208485,2017,11,18,7,25,5178,517.00,0,0
48395,208485,2017,12,30,18,48,8094,809.00,0,0
48396,208485,2018,1,4,3,7,2114,211.00,0,0
48397,208485,2018,2,8,0,8,1408,151.20,0,0
48398,208485,2018,3,11,2,13,2431,262.44,0,0
48399,208485,2018,4,0,0,0,0,0.00,0,0
48400,208485,2018,5,6,0,6,2976,297.00,0,0
48401,208485,2018,6,8,7,15,5025,502.00,0,0
48402,208485,2018,7,4,4,8,2208,220.00,0,0
48403,208485,2018,8,0,0,0,0,0.00,0,0
48404,208485,2018,9,0,0,0,0,0.00,0,0
48405,208485,2018,10,13,6,19,3838,383.00,0,0
48406,208485,2018,11,2,2,4,2132,212.00,0,0
48407,208485,2018,12,1,0,1,3485,348.00,0,0

In [48]:
sp.exploracion(df_flight_agrupado)

El DataFrame tiene 401688 filas y 10 columnas.
    Tiene 0 datos duplicados, lo que supone un porcentaje de 0.0% de los datos.

    Hay 0 columnas con datos nulos, y son:
    []

    y sin nulos hay 10 columnas y son:
    ['Loyalty Number', 'Year', 'Month', 'Flights Booked', 'Flights with Companions', 'Total Flights', 'Distance', 'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed']


    A continuaci贸n tienes un detalle sobre los datos nulos y los tipos y n煤mero de datos:

                        % nulos % no_nulos tipo_dato  num_valores_unicos
Loyalty Number             0.0%     100.0%     int64               16737
Year                       0.0%     100.0%     int64                   2
Month                      0.0%     100.0%     int64                  12
Flights Booked             0.0%     100.0%     int64                  40
Flights with Companions    0.0%     100.0%     int64                  21

Principales estad铆sticos de las columnas categ贸ricas:
No hay columnas categ贸ricas en el DataFrame.
Principales estad铆sticos de las columnas num茅ricas:

,count,mean,std,min,25%,50%,75%,max
Loyalty Number,401688.0,549735.880445,258904.719886,100018.0,326603.00,550434.0,772019.00,999986.0
Year,401688.0,2017.500000,0.500001,2017.0,2017.00,2017.5,2018.00,2018.0
Month,401688.0,6.500000,3.452057,1.0,3.75,6.5,9.25,12.0
Flights Booked,401688.0,4.155374,5.269271,0.0,0.00,1.0,8.00,39.0
Flights with Companions,401688.0,1.041916,2.090835,0.0,0.00,0.0,1.00,20.0
Total Flights,401688.0,5.197290,6.576952,0.0,0.00,1.0,10.00,57.0
Distance,401688.0,1220.725451,1446.440549,0.0,0.00,524.0,2352.00,11244.0
Points Accumulated,401688.0,124.904743,147.982107,0.0,0.00,53.0,240.00,1216.5
Points Redeemed,401688.0,30.997660,126.104987,0.0,0.00,0.0,0.00,996.0
Dollar Cost Points Redeemed,401688.0,2.508848,10.200090,0.0,0.00,0.0,0.00,80.0

                            % nulos % no_nulos tipo_dato  num_valores_unicos
Loyalty Number                 0.0%     100.0%     int64               16737
Year                           0.0%     100.0%     int64                   2
Month                          0.0%     100.0%     int64                  12
Flights Booked                 0.0%     100.0%     int64                  40
Flights with Companions        0.0%     100.0%     int64                  21
Total Flights                  0.0%     100.0%     int64                  52
Distance                       0.0%     100.0%     int64                5169
Points Accumulated             0.0%     100.0%   float64                1736
Points Redeemed                0.0%     100.0%     int64                 591
Dollar Cost Points Redeemed    0.0%     100.0%     int64                  52

In [11]:
df_loyalty["Cancellation Year"].unique()

<IntegerArray>
[<NA>, 2018, 2015, 2017, 2014, 2016, 2013]
Length: 7, dtype: Int64

In [6]:
# Convierto los valores de  Cancellation Year y Cancelation month  integer y conservo los nulos
sp.convertir_int(df_loyalty, "Cancellation Year")

In [7]:
sp.convertir_int(df_loyalty, "Cancellation Month")

In [8]:
df_loyalty.head()

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,<NA>,<NA>
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,<NA>,<NA>
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018,1
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,<NA>,<NA>
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,<NA>,<NA>

In [9]:
#Uno los dos dataframes con merge por la columna en comun loyalty number
df_union = df_flight_agrupado.merge(df_loyalty, on = "Loyalty Number")

In [10]:
df_union.head()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,100018,2017,1,3,0,3,1521,152.0,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.0,Married,Aurora,7919.2,Standard,2016,8,<NA>,<NA>
1,100018,2017,2,2,2,4,1320,132.0,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.0,Married,Aurora,7919.2,Standard,2016,8,<NA>,<NA>
2,100018,2017,3,14,3,17,2533,253.0,438,36,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.0,Married,Aurora,7919.2,Standard,2016,8,<NA>,<NA>
3,100018,2017,4,4,0,4,924,92.0,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.0,Married,Aurora,7919.2,Standard,2016,8,<NA>,<NA>
4,100018,2017,5,0,0,0,0,0.0,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.0,Married,Aurora,7919.2,Standard,2016,8,<NA>,<NA>

In [17]:
df_union["Loyalty Card"].unique()

array(['Aurora', 'Nova', 'Star'], dtype=object)

# FASE 2: VIsualizaci贸n

In [13]:
# 驴C贸mo se distribuye la cantidad de vuelos reservados por mes durante el a帽o?
df_union.groupby(["Year", "Month"])["Flights Booked"].sum().reset_index()

    Year  Month  Flights Booked
0   2017      1           47766
1   2017      2           47691
2   2017      3           64271
3   2017      4           55720
4   2017      5           65279
5   2017      6           80493
6   2017      7           89288
7   2017      8           78692
8   2017      9           63304
9   2017     10           60351
10  2017     11           56905
11  2017     12           77650
12  2018      1           49170
13  2018      2           48643
14  2018      3           66928
15  2018      4           56791
16  2018      5           76891
17  2018      6           92749
18  2018      7          104143
19  2018      8           90512
20  2018      9           73075
21  2018     10           69110
22  2018     11           65345
23  2018     12           88397

In [ ]:
sns.scatterplot(x= "Year", )